7767517
458 538
Input                    in0                      0 1 in0
Convolution              conv_0                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_106                 1 1 1 2
Convolution              conv_1                   1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_107                 1 1 3 4
Convolution              conv_2                   1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_108                 1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,16,16 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_3                   1 1 11 12 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Swish                    silu_109                 1 1 12 13
Convolution              conv_4                   1 1 13 14 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Swish                    silu_110                 1 1 14 15
BinaryOp                 add_0                    2 1 10 15 16 0=0
Concat                   cat_0                    3 1 7 9 16 17 0=0
Convolution              conv_5                   1 1 17 18 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Swish                    silu_111                 1 1 18 19
Convolution              conv_6                   1 1 19 20 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_112                 1 1 20 21
Convolution              conv_7                   1 1 21 22 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_113                 1 1 22 23
Slice                    split_1                  1 2 23 24 25 -23300=2,32,32 1=0
Split                    splitncnn_1              1 3 25 26 27 28
Convolution              conv_8                   1 1 28 29 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_114                 1 1 29 30
Convolution              conv_9                   1 1 30 31 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_115                 1 1 31 32
BinaryOp                 add_1                    2 1 27 32 33 0=0
Concat                   cat_1                    3 1 24 26 33 34 0=0
Convolution              conv_10                  1 1 34 35 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_116                 1 1 35 36
Split                    splitncnn_2              1 2 36 37 38
Convolution              conv_11                  1 1 38 39 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_117                 1 1 39 40
Convolution              conv_12                  1 1 40 41 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_118                 1 1 41 42
Split                    splitncnn_3              1 3 42 43 44 45
Convolution              conv_13                  1 1 45 46 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Reshape                  flatten_327              1 1 46 47 0=1600 1=192
Permute                  transpose_288            1 1 47 48 0=1
Reshape                  reshape_239              1 1 48 49 0=96 1=2 11=400 2=4
Permute                  permute_199              1 1 49 50 0=3
Slice                    split_2                  1 3 50 51 52 53 -23300=3,32,32,32 1=2
Split                    splitncnn_4              1 2 53 54 55
Permute                  transpose_289            1 1 51 56 0=1
MatMul                   matmul_272               2 1 56 52 57
BinaryOp                 mul_2                    1 1 57 58 0=2 1=1 2=0.176777
Softmax                  softmax_190              1 1 58 59 0=3 1=1
MatMul                   matmultransb_0           2 1 55 59 60 0=1
Permute                  permute_200              1 1 60 61 0=4
Permute                  permute_201              1 1 54 62 0=4
Reshape                  reshape_240              1 1 61 63 0=64 1=40 2=40
Permute                  permute_202              1 1 63 64 0=4
Reshape                  reshape_241              1 1 62 65 0=64 1=40 2=40
Permute                  permute_203              1 1 65 66 0=4
ConvolutionDepthWise     convdw_313               1 1 66 67 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=3136 7=64
BinaryOp                 add_3                    2 1 64 67 68 0=0
Convolution              conv_14                  1 1 68 69 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_4                    2 1 44 69 70 0=0
Split                    splitncnn_5              1 2 70 71 72
Convolution              conv_15                  1 1 72 73 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_119                 1 1 73 74
Convolution              conv_16                  1 1 74 75 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_5                    2 1 71 75 76 0=0
Split                    splitncnn_6              1 2 76 77 78
Convolution              conv_17                  1 1 78 79 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Reshape                  flatten_328              1 1 79 80 0=1600 1=192
Permute                  transpose_291            1 1 80 81 0=1
Reshape                  reshape_242              1 1 81 82 0=96 1=2 11=400 2=4
Permute                  permute_204              1 1 82 83 0=3
Slice                    split_3                  1 3 83 84 85 86 -23300=3,32,32,32 1=2
Split                    splitncnn_7              1 2 86 87 88
Permute                  transpose_292            1 1 84 89 0=1
MatMul                   matmul_274               2 1 89 85 90
BinaryOp                 mul_6                    1 1 90 91 0=2 1=1 2=0.176777
Softmax                  softmax_191              1 1 91 92 0=3 1=1
MatMul                   matmultransb_1           2 1 88 92 93 0=1
Permute                  permute_205              1 1 93 94 0=4
Permute                  permute_206              1 1 87 95 0=4
Reshape                  reshape_243              1 1 94 96 0=64 1=40 2=40
Permute                  permute_207              1 1 96 97 0=4
Reshape                  reshape_244              1 1 95 98 0=64 1=40 2=40
Permute                  permute_208              1 1 98 99 0=4
ConvolutionDepthWise     convdw_314               1 1 99 100 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=3136 7=64
BinaryOp                 add_7                    2 1 97 100 101 0=0
Convolution              conv_18                  1 1 101 102 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_8                    2 1 77 102 103 0=0
Split                    splitncnn_8              1 2 103 104 105
Convolution              conv_19                  1 1 105 106 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_120                 1 1 106 107
Convolution              conv_20                  1 1 107 108 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_9                    2 1 104 108 109 0=0
Split                    splitncnn_9              1 3 109 110 111 112
Convolution              conv_21                  1 1 112 113 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Reshape                  flatten_329              1 1 113 114 0=1600 1=192
Permute                  transpose_294            1 1 114 115 0=1
Reshape                  reshape_245              1 1 115 116 0=96 1=2 11=400 2=4
Permute                  permute_209              1 1 116 117 0=3
Slice                    split_4                  1 3 117 118 119 120 -23300=3,32,32,32 1=2
Split                    splitncnn_10             1 2 120 121 122
Permute                  transpose_295            1 1 118 123 0=1
MatMul                   matmul_276               2 1 123 119 124
BinaryOp                 mul_10                   1 1 124 125 0=2 1=1 2=0.176777
Softmax                  softmax_192              1 1 125 126 0=3 1=1
MatMul                   matmultransb_2           2 1 122 126 127 0=1
Permute                  permute_210              1 1 127 128 0=4
Permute                  permute_211              1 1 121 129 0=4
Reshape                  reshape_246              1 1 128 130 0=64 1=40 2=40
Permute                  permute_212              1 1 130 131 0=4
Reshape                  reshape_247              1 1 129 132 0=64 1=40 2=40
Permute                  permute_213              1 1 132 133 0=4
ConvolutionDepthWise     convdw_315               1 1 133 134 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=3136 7=64
BinaryOp                 add_11                   2 1 131 134 135 0=0
Convolution              conv_22                  1 1 135 136 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_12                   2 1 111 136 137 0=0
Split                    splitncnn_11             1 2 137 138 139
Convolution              conv_23                  1 1 139 140 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_121                 1 1 140 141
Convolution              conv_24                  1 1 141 142 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_13                   2 1 138 142 143 0=0
Split                    splitncnn_12             1 2 143 144 145
Convolution              conv_25                  1 1 145 146 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Reshape                  flatten_330              1 1 146 147 0=1600 1=192
Permute                  transpose_297            1 1 147 148 0=1
Reshape                  reshape_248              1 1 148 149 0=96 1=2 11=400 2=4
Permute                  permute_214              1 1 149 150 0=3
Slice                    split_5                  1 3 150 151 152 153 -23300=3,32,32,32 1=2
Split                    splitncnn_13             1 2 153 154 155
Permute                  transpose_298            1 1 151 156 0=1
MatMul                   matmul_278               2 1 156 152 157
BinaryOp                 mul_14                   1 1 157 158 0=2 1=1 2=0.176777
Softmax                  softmax_193              1 1 158 159 0=3 1=1
MatMul                   matmultransb_3           2 1 155 159 160 0=1
Permute                  permute_215              1 1 160 161 0=4
Permute                  permute_216              1 1 154 162 0=4
Reshape                  reshape_249              1 1 161 163 0=64 1=40 2=40
Permute                  permute_217              1 1 163 164 0=4
Reshape                  reshape_250              1 1 162 165 0=64 1=40 2=40
Permute                  permute_218              1 1 165 166 0=4
ConvolutionDepthWise     convdw_316               1 1 166 167 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=3136 7=64
BinaryOp                 add_15                   2 1 164 167 168 0=0
Convolution              conv_26                  1 1 168 169 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_16                   2 1 144 169 170 0=0
Split                    splitncnn_14             1 2 170 171 172
Convolution              conv_27                  1 1 172 173 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_122                 1 1 173 174
Convolution              conv_28                  1 1 174 175 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_17                   2 1 171 175 176 0=0
Concat                   cat_2                    3 1 43 110 176 177 0=0
Convolution              conv_29                  1 1 177 178 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_123                 1 1 178 179
Split                    splitncnn_15             1 2 179 180 181
Convolution              conv_30                  1 1 181 182 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_124                 1 1 182 183
Convolution              conv_31                  1 1 183 184 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_125                 1 1 184 185
Split                    splitncnn_16             1 3 185 186 187 188
Convolution              conv_32                  1 1 188 189 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Reshape                  flatten_331              1 1 189 190 0=400 1=384
Permute                  transpose_300            1 1 190 191 0=1
Reshape                  reshape_251              1 1 191 192 0=96 1=4 2=400
Permute                  permute_219              1 1 192 193 0=3
Slice                    split_6                  1 3 193 194 195 196 -23300=3,32,32,32 1=1
Split                    splitncnn_17             1 2 196 197 198
Permute                  transpose_301            1 1 194 199 0=1
MatMul                   matmul_280               2 1 199 195 200
BinaryOp                 mul_18                   1 1 200 201 0=2 1=1 2=0.176777
Softmax                  softmax_194              1 1 201 202 0=2 1=1
MatMul                   matmultransb_4           2 1 198 202 203 0=1
Permute                  permute_220              1 1 203 204 0=4
Permute                  permute_221              1 1 197 205 0=4
Reshape                  reshape_252              1 1 204 206 0=128 1=20 2=20
Permute                  permute_222              1 1 206 207 0=4
Reshape                  reshape_253              1 1 205 208 0=128 1=20 2=20
Permute                  permute_223              1 1 208 209 0=4
ConvolutionDepthWise     convdw_317               1 1 209 210 0=128 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=6272 7=128
BinaryOp                 add_19                   2 1 207 210 211 0=0
Convolution              conv_33                  1 1 211 212 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_20                   2 1 187 212 213 0=0
Split                    splitncnn_18             1 2 213 214 215
Convolution              conv_34                  1 1 215 216 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_126                 1 1 216 217
Convolution              conv_35                  1 1 217 218 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_21                   2 1 214 218 219 0=0
Split                    splitncnn_19             1 2 219 220 221
Convolution              conv_36                  1 1 221 222 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Reshape                  flatten_332              1 1 222 223 0=400 1=384
Permute                  transpose_303            1 1 223 224 0=1
Reshape                  reshape_254              1 1 224 225 0=96 1=4 2=400
Permute                  permute_224              1 1 225 226 0=3
Slice                    split_7                  1 3 226 227 228 229 -23300=3,32,32,32 1=1
Split                    splitncnn_20             1 2 229 230 231
Permute                  transpose_304            1 1 227 232 0=1
MatMul                   matmul_282               2 1 232 228 233
BinaryOp                 mul_22                   1 1 233 234 0=2 1=1 2=0.176777
Softmax                  softmax_195              1 1 234 235 0=2 1=1
MatMul                   matmultransb_5           2 1 231 235 236 0=1
Permute                  permute_225              1 1 236 237 0=4
Permute                  permute_226              1 1 230 238 0=4
Reshape                  reshape_255              1 1 237 239 0=128 1=20 2=20
Permute                  permute_227              1 1 239 240 0=4
Reshape                  reshape_256              1 1 238 241 0=128 1=20 2=20
Permute                  permute_228              1 1 241 242 0=4
ConvolutionDepthWise     convdw_318               1 1 242 243 0=128 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=6272 7=128
BinaryOp                 add_23                   2 1 240 243 244 0=0
Convolution              conv_37                  1 1 244 245 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_24                   2 1 220 245 246 0=0
Split                    splitncnn_21             1 2 246 247 248
Convolution              conv_38                  1 1 248 249 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_127                 1 1 249 250
Convolution              conv_39                  1 1 250 251 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_25                   2 1 247 251 252 0=0
Split                    splitncnn_22             1 3 252 253 254 255
Convolution              conv_40                  1 1 255 256 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Reshape                  flatten_333              1 1 256 257 0=400 1=384
Permute                  transpose_306            1 1 257 258 0=1
Reshape                  reshape_257              1 1 258 259 0=96 1=4 2=400
Permute                  permute_229              1 1 259 260 0=3
Slice                    split_8                  1 3 260 261 262 263 -23300=3,32,32,32 1=1
Split                    splitncnn_23             1 2 263 264 265
Permute                  transpose_307            1 1 261 266 0=1
MatMul                   matmul_284               2 1 266 262 267
BinaryOp                 mul_26                   1 1 267 268 0=2 1=1 2=0.176777
Softmax                  softmax_196              1 1 268 269 0=2 1=1
MatMul                   matmultransb_6           2 1 265 269 270 0=1
Permute                  permute_230              1 1 270 271 0=4
Permute                  permute_231              1 1 264 272 0=4
Reshape                  reshape_258              1 1 271 273 0=128 1=20 2=20
Permute                  permute_232              1 1 273 274 0=4
Reshape                  reshape_259              1 1 272 275 0=128 1=20 2=20
Permute                  permute_233              1 1 275 276 0=4
ConvolutionDepthWise     convdw_319               1 1 276 277 0=128 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=6272 7=128
BinaryOp                 add_27                   2 1 274 277 278 0=0
Convolution              conv_41                  1 1 278 279 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_28                   2 1 254 279 280 0=0
Split                    splitncnn_24             1 2 280 281 282
Convolution              conv_42                  1 1 282 283 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_128                 1 1 283 284
Convolution              conv_43                  1 1 284 285 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_29                   2 1 281 285 286 0=0
Split                    splitncnn_25             1 2 286 287 288
Convolution              conv_44                  1 1 288 289 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Reshape                  flatten_334              1 1 289 290 0=400 1=384
Permute                  transpose_309            1 1 290 291 0=1
Reshape                  reshape_260              1 1 291 292 0=96 1=4 2=400
Permute                  permute_234              1 1 292 293 0=3
Slice                    split_9                  1 3 293 294 295 296 -23300=3,32,32,32 1=1
Split                    splitncnn_26             1 2 296 297 298
Permute                  transpose_310            1 1 294 299 0=1
MatMul                   matmul_286               2 1 299 295 300
BinaryOp                 mul_30                   1 1 300 301 0=2 1=1 2=0.176777
Softmax                  softmax_197              1 1 301 302 0=2 1=1
MatMul                   matmultransb_7           2 1 298 302 303 0=1
Permute                  permute_235              1 1 303 304 0=4
Permute                  permute_236              1 1 297 305 0=4
Reshape                  reshape_261              1 1 304 306 0=128 1=20 2=20
Permute                  permute_237              1 1 306 307 0=4
Reshape                  reshape_262              1 1 305 308 0=128 1=20 2=20
Permute                  permute_238              1 1 308 309 0=4
ConvolutionDepthWise     convdw_320               1 1 309 310 0=128 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=6272 7=128
BinaryOp                 add_31                   2 1 307 310 311 0=0
Convolution              conv_45                  1 1 311 312 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_32                   2 1 287 312 313 0=0
Split                    splitncnn_27             1 2 313 314 315
Convolution              conv_46                  1 1 315 316 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_129                 1 1 316 317
Convolution              conv_47                  1 1 317 318 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_33                   2 1 314 318 319 0=0
Concat                   cat_3                    3 1 186 253 319 320 0=0
Convolution              conv_48                  1 1 320 321 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_130                 1 1 321 322
Split                    splitncnn_28             1 2 322 323 324
Interp                   upsample_187             1 1 324 325 0=1 1=2.0 2=2.0 6=0
Concat                   cat_4                    2 1 325 180 326 0=0
Convolution              conv_49                  1 1 326 327 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_131                 1 1 327 328
Split                    splitncnn_29             1 3 328 329 330 331
Convolution              conv_50                  1 1 331 332 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_132                 1 1 332 333
Split                    splitncnn_30             1 2 333 334 335
Convolution              conv_51                  1 1 335 336 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_133                 1 1 336 337
Convolution              conv_52                  1 1 337 338 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_134                 1 1 338 339
BinaryOp                 add_34                   2 1 334 339 340 0=0
Split                    splitncnn_31             1 2 340 341 342
Convolution              conv_53                  1 1 342 343 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_135                 1 1 343 344
Convolution              conv_54                  1 1 344 345 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_136                 1 1 345 346
BinaryOp                 add_35                   2 1 341 346 347 0=0
Convolution              conv_55                  1 1 330 348 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_137                 1 1 348 349
Concat                   cat_5                    2 1 347 349 350 0=0
Convolution              conv_56                  1 1 350 351 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_138                 1 1 351 352
Concat                   cat_6                    2 1 329 352 353 0=0
Convolution              conv_57                  1 1 353 354 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_139                 1 1 354 355
Split                    splitncnn_32             1 2 355 356 357
Interp                   upsample_188             1 1 357 358 0=1 1=2.0 2=2.0 6=0
Concat                   cat_7                    2 1 358 37 359 0=0
Convolution              conv_58                  1 1 359 360 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_140                 1 1 360 361
Split                    splitncnn_33             1 3 361 362 363 364
Convolution              conv_59                  1 1 364 365 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_141                 1 1 365 366
Split                    splitncnn_34             1 2 366 367 368
Convolution              conv_60                  1 1 368 369 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_142                 1 1 369 370
Convolution              conv_61                  1 1 370 371 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_143                 1 1 371 372
BinaryOp                 add_36                   2 1 367 372 373 0=0
Split                    splitncnn_35             1 2 373 374 375
Convolution              conv_62                  1 1 375 376 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_144                 1 1 376 377
Convolution              conv_63                  1 1 377 378 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_145                 1 1 378 379
BinaryOp                 add_37                   2 1 374 379 380 0=0
Convolution              conv_64                  1 1 363 381 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_146                 1 1 381 382
Concat                   cat_8                    2 1 380 382 383 0=0
Convolution              conv_65                  1 1 383 384 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_147                 1 1 384 385
Concat                   cat_9                    2 1 362 385 386 0=0
Convolution              conv_66                  1 1 386 387 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_148                 1 1 387 388
Split                    splitncnn_36             1 3 388 389 390 391
Convolution              conv_67                  1 1 390 392 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_149                 1 1 392 393
Concat                   cat_10                   2 1 393 356 394 0=0
Convolution              conv_68                  1 1 394 395 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_150                 1 1 395 396
Split                    splitncnn_37             1 3 396 397 398 399
Convolution              conv_69                  1 1 399 400 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_151                 1 1 400 401
Split                    splitncnn_38             1 2 401 402 403
Convolution              conv_70                  1 1 403 404 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_152                 1 1 404 405
Convolution              conv_71                  1 1 405 406 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_153                 1 1 406 407
BinaryOp                 add_38                   2 1 402 407 408 0=0
Split                    splitncnn_39             1 2 408 409 410
Convolution              conv_72                  1 1 410 411 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_154                 1 1 411 412
Convolution              conv_73                  1 1 412 413 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_155                 1 1 413 414
BinaryOp                 add_39                   2 1 409 414 415 0=0
Convolution              conv_74                  1 1 398 416 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_156                 1 1 416 417
Concat                   cat_11                   2 1 415 417 418 0=0
Convolution              conv_75                  1 1 418 419 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_157                 1 1 419 420
Concat                   cat_12                   2 1 397 420 421 0=0
Convolution              conv_76                  1 1 421 422 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_158                 1 1 422 423
Split                    splitncnn_40             1 3 423 424 425 426
Convolution              conv_77                  1 1 425 427 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_159                 1 1 427 428
Concat                   cat_13                   2 1 428 323 429 0=0
Convolution              conv_78                  1 1 429 430 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_160                 1 1 430 431
Slice                    split_10                 1 2 431 432 433 -23300=2,128,128 1=0
Split                    splitncnn_41             1 3 433 434 435 436
Convolution              conv_79                  1 1 436 437 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_161                 1 1 437 438
Split                    splitncnn_42             1 2 438 439 440
Convolution              conv_80                  1 1 440 441 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_162                 1 1 441 442
Convolution              conv_81                  1 1 442 443 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_163                 1 1 443 444
BinaryOp                 add_40                   2 1 439 444 445 0=0
Split                    splitncnn_43             1 2 445 446 447
Convolution              conv_82                  1 1 447 448 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_164                 1 1 448 449
Convolution              conv_83                  1 1 449 450 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_165                 1 1 450 451
BinaryOp                 add_41                   2 1 446 451 452 0=0
Convolution              conv_84                  1 1 435 453 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_166                 1 1 453 454
Concat                   cat_14                   2 1 452 454 455 0=0
Convolution              conv_85                  1 1 455 456 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_167                 1 1 456 457
Concat                   cat_15                   3 1 432 434 457 458 0=0
Convolution              conv_86                  1 1 458 459 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_168                 1 1 459 460
Split                    splitncnn_44             1 2 460 461 462
MemoryData               pnnx_1046                0 1 463 0=8400
Convolution              conv_87                  1 1 389 464 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_169                 1 1 464 465
Convolution              conv_88                  1 1 465 466 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_170                 1 1 466 467
Convolution              conv_89                  1 1 467 468 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_263              1 1 468 469 0=6400 1=64
Convolution              conv_90                  1 1 424 470 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_171                 1 1 470 471
Convolution              conv_91                  1 1 471 472 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_172                 1 1 472 473
Convolution              conv_92                  1 1 473 474 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_264              1 1 474 475 0=1600 1=64
Convolution              conv_93                  1 1 461 476 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_173                 1 1 476 477
Convolution              conv_94                  1 1 477 478 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_174                 1 1 478 479
Convolution              conv_95                  1 1 479 480 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_265              1 1 480 481 0=400 1=64
Concat                   cat_16                   3 1 469 475 481 482 0=1
ConvolutionDepthWise     convdw_321               1 1 391 483 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Swish                    silu_175                 1 1 483 484
Convolution              conv_96                  1 1 484 485 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_176                 1 1 485 486
ConvolutionDepthWise     convdw_322               1 1 486 487 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Swish                    silu_177                 1 1 487 488
Convolution              conv_97                  1 1 488 489 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_178                 1 1 489 490
Convolution              conv_98                  1 1 490 491 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Reshape                  reshape_266              1 1 491 492 0=6400 1=1
ConvolutionDepthWise     convdw_323               1 1 426 493 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Swish                    silu_179                 1 1 493 494
Convolution              conv_99                  1 1 494 495 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_180                 1 1 495 496
ConvolutionDepthWise     convdw_324               1 1 496 497 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Swish                    silu_181                 1 1 497 498
Convolution              conv_100                 1 1 498 499 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_182                 1 1 499 500
Convolution              conv_101                 1 1 500 501 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Reshape                  reshape_267              1 1 501 502 0=1600 1=1
ConvolutionDepthWise     convdw_325               1 1 462 503 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_183                 1 1 503 504
Convolution              conv_102                 1 1 504 505 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_184                 1 1 505 506
ConvolutionDepthWise     convdw_326               1 1 506 507 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Swish                    silu_185                 1 1 507 508
Convolution              conv_103                 1 1 508 509 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_186                 1 1 509 510
Convolution              conv_104                 1 1 510 511 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Reshape                  reshape_268              1 1 511 512 0=400 1=1
Concat                   cat_17                   3 1 492 502 512 513 0=1
Reshape                  reshape_269              1 1 482 514 0=8400 1=16 2=4
Permute                  transpose_312            1 1 514 515 0=2
Softmax                  softmax_198              1 1 515 516 0=0 1=1
Convolution              conv_105                 1 1 516 517 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  reshape_270              1 1 517 518 0=8400 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 519 0=8400 1=2
Split                    splitncnn_0              1 2 519 520 521
Slice                    chunk_0                  1 2 518 522 523 -23300=2,-233,-233 1=0
BinaryOp                 sub_42                   2 1 520 522 524 0=1
Split                    splitncnn_45             1 2 524 525 526
BinaryOp                 add_43                   2 1 521 523 527 0=0
Split                    splitncnn_46             1 2 527 528 529
BinaryOp                 add_44                   2 1 525 528 530 0=0
BinaryOp                 div_45                   1 1 530 531 0=3 1=1 2=2.0
BinaryOp                 sub_46                   2 1 529 526 532 0=1
Concat                   cat_18                   2 1 531 532 533 0=0
Reshape                  reshape_271              1 1 463 534 0=8400 1=1
BinaryOp                 mul_47                   2 1 533 534 535 0=2
Sigmoid                  sigmoid_189              1 1 513 536
Concat                   cat_19                   2 1 535 536 out0 0=0
